In [1]:
import pandas as pd

In [2]:
olympic_data_list = {'London': {2012: 205}, 'Beijing': {2008: 204}}

In [3]:
df_olympic_data_list = pd.DataFrame(olympic_data_list)
df_olympic_data_list

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

In [4]:
data = {'regno': ['21BDS0340', '21BDS0341'], 'studname': ['abc', 'def'], 'cgpa': [8.5, 9.2]}
DF1 = pd.DataFrame(data)
DF1

       regno studname  cgpa
0  21BDS0340      abc   8.5
1  21BDS0341      def   9.2

In [5]:
DF2 = pd.DataFrame({'regno': ['21BDS0342', '21BDS0343'], 'studname': ['ghi', 'jkl'], 'cgpa': [5.6, 10]})
DF2

       regno studname  cgpa
0  21BDS0342      ghi   5.6
1  21BDS0343      jkl  10.0

In [6]:
pd.concat([DF1, DF2])

       regno studname  cgpa
0  21BDS0340      abc   8.5
1  21BDS0341      def   9.2
0  21BDS0342      ghi   5.6
1  21BDS0343      jkl  10.0

In [7]:
rating = pd.DataFrame(
{
    'movie1': [5, 4, 3, 3, 2, 1],
    'movie2': [4, 5, 2, 3, 4, 2]
},
index = ['Tom', 'Jeff', 'Peter', 'Ram', 'Ted', 'Paul'])
rating

       movie1  movie2
Tom         5       4
Jeff        4       5
Peter       3       2
Ram         3       3
Ted         2       4
Paul        1       2

In [8]:
def movie_grade(rating):
    if rating == 5:
        return 'A'
    if rating == 4:
        return 'B'
    if rating == 3:
        return 'C'
    else:
        return 'F'

In [9]:
grade = rating.applymap(movie_grade)
grade

      movie1 movie2
Tom        A      B
Jeff       B      A
Peter      C      F
Ram        C      C
Ted        F      B
Paul       F      F

In [10]:
pd.concat([rating, grade], axis = 1)

      movie1 movie2 movie1 movie2
Tom        5      4      A      B
Jeff       4      5      B      A
Peter      3      2      C      F
Ram        3      3      C      C
Ted        2      4      F      B
Paul       1      2      F      F

In [11]:
rating.max()

movie1    5
movie2    5
dtype: int64

In [12]:
rating.mean()

movie1    3.000000
movie2    3.333333
dtype: float64

In [13]:
rating.std()

movie1    1.414214
movie2    1.211060
dtype: float64

In [14]:
president_names = pd.DataFrame({
    'first': ['George', 'Bill', 'Ronald'],
    'last': ['Bush', 'Clinton', 'Reagan']
})
president_names

    first     last
0  George     Bush
1    Bill  Clinton
2  Ronald   Reagan

In [15]:
president_names.sort_values('first')

    first     last
1    Bill  Clinton
0  George     Bush
2  Ronald   Reagan